scitifical_package.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-23 Sa 13:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Scientific packages</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="sx" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Scientific packages</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8110be4">pandas</a>
<ul>
<li><a href="#orgd2ea4fb">plot.scatter()</a></li>
</ul>
</li>
<li><a href="#orge0e67f3">matplotlib.plot</a>
<ul>
<li><a href="#org2f03a05">two linear plot</a></li>
<li><a href="#orgdf5cadd">simplest linear plot</a></li>
<li><a href="#org2e02a0c">simplest point plot</a></li>
<li><a href="#orgb036730">simplest function plot</a></li>
<li><a href="#org573b8b9">simplest subplot</a></li>
<li><a href="#org6fc8eed">histogram plot with cusomised legend</a></li>
<li><a href="#org9492b27">histogram plot</a></li>
<li><a href="#orge356ab1">histogram y axis with log index</a></li>
<li><a href="#org7e4db12">a example of mean standrad deviation plotting</a></li>
</ul>
</li>
<li><a href="#orgdb4797b">Backlinks</a></li>
<li><a href="#orgcfec23c">1 Backlinks</a>
<ul>
<li><a href="#org50bde88">AI</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8110be4" class="outline-2">
<h2 id="org8110be4">pandas</h2>
<div class="outline-text-2" id="text-org8110be4">
</div>
<div id="outline-container-orgd2ea4fb" class="outline-3">
<h3 id="orgd2ea4fb">plot.scatter()</h3>
<div class="outline-text-3" id="text-orgd2ea4fb">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> pandas <span style="color: #4f97d7; font-weight: bold;">as</span> pd
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #7590db;">a</span> = pd.DataFrame(np.random.rand(3,3))
<span style="color: #4f97d7; font-weight: bold;">print</span>(a)
a.plot.scatter(x=0, y = 0)

</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-orge0e67f3" class="outline-2">
<h2 id="orge0e67f3">matplotlib.plot</h2>
<div class="outline-text-2" id="text-orge0e67f3">
</div>
<div id="outline-container-org2f03a05" class="outline-3">
<h3 id="org2f03a05">two linear plot</h3>
<div class="outline-text-3" id="text-org2f03a05">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> random
<span style="color: #4f97d7; font-weight: bold;">from</span> matplotlib <span style="color: #4f97d7; font-weight: bold;">import</span> pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #7590db;">a</span> = np.array([ x <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(10)])
<span style="color: #7590db;">b</span> = np.array([[random.randint(0,10) <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(10)],[random.randint(0,10) <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(10)]])
plt.plot(a,b.T)
plt.show()


</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf5cadd" class="outline-3">
<h3 id="orgdf5cadd">simplest linear plot</h3>
<div class="outline-text-3" id="text-orgdf5cadd">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
plt.plot([1,2,3,4])
plt.ylabel(<span style="color: #2d9574;">'some numbers'</span>)
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-org2e02a0c" class="outline-3">
<h3 id="org2e02a0c">simplest point plot</h3>
<div class="outline-text-3" id="text-org2e02a0c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
plt.plot([1,2,3,4], [1,4,9,16], <span style="color: #2d9574;">'ro'</span>)
plt.axis([0, 6, 0, 20])
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-orgb036730" class="outline-3">
<h3 id="orgb036730">simplest function plot</h3>
<div class="outline-text-3" id="text-orgb036730">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">evenly sampled time at 200ms intervals</span>
<span style="color: #7590db;">t</span> = np.arange(0., 5., 0.2)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">red dashes, blue squares and green triangles</span>
plt.plot(t, t, <span style="color: #2d9574;">'r--'</span>, t, t**2, <span style="color: #2d9574;">'bs'</span>, t, t**3, <span style="color: #2d9574;">'g^'</span>)
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-org573b8b9" class="outline-3">
<h3 id="org573b8b9">simplest subplot</h3>
<div class="outline-text-3" id="text-org573b8b9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">f</span>(t):
    <span style="color: #4f97d7; font-weight: bold;">return</span> np.exp(-t) * np.cos(2*np.pi*t)

<span style="color: #7590db;">t1</span> = np.arange(0.0, 5.0, 0.1)
<span style="color: #7590db;">t2</span> = np.arange(0.0, 5.0, 0.02)

plt.figure(1)
plt.subplot(211)
plt.plot(t1, f(t1), <span style="color: #2d9574;">'bo'</span>, t2, f(t2), <span style="color: #2d9574;">'k'</span>)

plt.subplot(212)
plt.plot(t2, np.cos(2*np.pi*t2), <span style="color: #2d9574;">'r--'</span>)
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-org6fc8eed" class="outline-3">
<h3 id="org6fc8eed">histogram plot with cusomised legend</h3>
<div class="outline-text-3" id="text-org6fc8eed">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Fixing random state for reproducibility</span>
np.random.seed(19680801)

<span style="color: #7590db;">mu</span>, <span style="color: #7590db;">sigma</span> = 100, 15
<span style="color: #7590db;">x</span> = mu + sigma * np.random.randn(10000)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the histogram of the data</span>
<span style="color: #7590db;">n</span>, <span style="color: #7590db;">bins</span>, <span style="color: #7590db;">patches</span> = plt.hist(x, 50, normed=1, facecolor=<span style="color: #2d9574;">'g'</span>, alpha=0.75)


plt.xlabel(<span style="color: #2d9574;">'Smarts'</span>)
plt.ylabel(<span style="color: #2d9574;">'Probability'</span>)
plt.title(<span style="color: #2d9574;">'Histogram of IQ'</span>)
plt.text(60, .025, r<span style="color: #2d9574;">'$\mu=100,\ \sigma=15$'</span>)
plt.axis([40, 160, 0, 0.03])
plt.grid(<span style="color: #a45bad;">True</span>)
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-org9492b27" class="outline-3">
<h3 id="org9492b27">histogram plot</h3>
<div class="outline-text-3" id="text-org9492b27">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Fixing random state for reproducibility</span>
np.random.seed(19680801)

<span style="color: #7590db;">mu</span>, <span style="color: #7590db;">sigma</span> = 100, 15
<span style="color: #7590db;">x</span> = mu + sigma * np.random.randn(100000)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the histogram of the data</span>
<span style="color: #7590db;">n</span>, <span style="color: #7590db;">bins</span>, <span style="color: #7590db;">patches</span> = plt.hist(x, 50, facecolor=<span style="color: #2d9574;">'g'</span>)

plt.xlabel(<span style="color: #2d9574;">'Smarts'</span>)
plt.ylabel(<span style="color: #2d9574;">'Probability'</span>)
plt.title(<span style="color: #2d9574;">'Histogram of IQ'</span>)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">plt.text(60, .025, r'$\mu=100,\ \sigma=15$')</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">plt.axis([40, 160, 0, 0.03])</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">plt.grid(True)</span>
plt.show()



</pre>
</div>
</div>
</div>
<div id="outline-container-orge356ab1" class="outline-3">
<h3 id="orge356ab1">histogram y axis with log index</h3>
<div class="outline-text-3" id="text-orge356ab1">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
<span style="color: #4f97d7; font-weight: bold;">from</span> matplotlib.ticker <span style="color: #4f97d7; font-weight: bold;">import</span> NullFormatter  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">useful for `logit` scale</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Fixing random state for reproducibility</span>
np.random.seed(19680801)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">make up some data in the interval ]0, 1[</span>
<span style="color: #7590db;">y</span> = np.random.normal(loc=0.5, scale=0.4, size=1000)
<span style="color: #7590db;">y</span> = y[(y &gt; 0) &amp; (y &lt; 1)]
y.sort()
<span style="color: #7590db;">x</span> = np.arange(<span style="color: #4f97d7;">len</span>(y))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">plot with various axes scales</span>
plt.figure(1)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">linear</span>
plt.subplot(221)
plt.plot(x, y)
plt.yscale(<span style="color: #2d9574;">'linear'</span>)
plt.title(<span style="color: #2d9574;">'linear'</span>)
plt.grid(<span style="color: #a45bad;">True</span>)


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">log</span>
plt.subplot(222)
plt.plot(x, y)
plt.yscale(<span style="color: #2d9574;">'log'</span>)
plt.title(<span style="color: #2d9574;">'log'</span>)
plt.grid(<span style="color: #a45bad;">True</span>)


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">symmetric log</span>
plt.subplot(223)
plt.plot(x, y - y.mean())
plt.yscale(<span style="color: #2d9574;">'symlog'</span>, linthreshy=0.01)
plt.title(<span style="color: #2d9574;">'symlog'</span>)
plt.grid(<span style="color: #a45bad;">True</span>)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">logit</span>
plt.subplot(224)
plt.plot(x, y)
plt.yscale(<span style="color: #2d9574;">'logit'</span>)
plt.title(<span style="color: #2d9574;">'logit'</span>)
plt.grid(<span style="color: #a45bad;">True</span>)
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Format the minor tick labels of the y-axis into empty strings with</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">`NullFormatter`, to avoid cumbering the axis with too many labels.</span>
plt.gca().yaxis.set_minor_formatter(NullFormatter())
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Adjust the subplot layout, because the logit one may take more space</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">than usual, due to y-tick labels like "1 - 10^{-3}"</span>
plt.subplots_adjust(top=0.92, bottom=0.08, left=0.10, right=0.95, hspace=0.25, wspace=0.35)

plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-org7e4db12" class="outline-3">
<h3 id="org7e4db12">a example of mean standrad deviation plotting</h3>
<div class="outline-text-3" id="text-org7e4db12">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt;
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> scipy.stats
<span style="color: #4f97d7; font-weight: bold;">import</span> scipy <span style="color: #4f97d7; font-weight: bold;">as</span> sp
<span style="color: #4f97d7; font-weight: bold;">from</span> scipy <span style="color: #4f97d7; font-weight: bold;">import</span> integrate
<span style="color: #4f97d7; font-weight: bold;">from</span> scipy.optimize <span style="color: #4f97d7; font-weight: bold;">import</span> curve_fit

<span style="color: #7590db;">data</span> = np.genfromtxt(<span style="color: #2d9574;">'Highz_SN_data.txt'</span>);

<span style="color: #7590db;">redshift</span> = np.array([data[:,2]])
<span style="color: #7590db;">mu</span> = np.array([data[:,3]])
<span style="color: #7590db;">velocity</span> = np.array([data[:,4]])
<span style="color: #7590db;">redshift_mean</span> = np.mean(redshift)
<span style="color: #7590db;">mu_mean</span> = np.mean(mu)
<span style="color: #7590db;">velocity_mean</span> = np.mean(velocity)
<span style="color: #7590db;">redshift_std</span> = np.std(redshift)
<span style="color: #7590db;">mu_std</span> = np.std(mu)
<span style="color: #7590db;">velocity_std</span> = np.std(velocity)
<span style="color: #7590db;">para</span> = [<span style="color: #2d9574;">"redshift"</span>, <span style="color: #2d9574;">"mu"</span>, <span style="color: #2d9574;">"velocity"</span>]
<span style="color: #7590db;">x_pos</span> = np.arange(<span style="color: #4f97d7;">len</span>(para))
<span style="color: #7590db;">ctes</span> = [redshift_mean, mu_mean, velocity_mean]
<span style="color: #7590db;">error</span> = [redshift_std, mu_std, velocity_std]


<span style="color: #7590db;">fig</span>, <span style="color: #7590db;">ax</span> = plt.subplots()
ax.bar(x_pos, ctes, yerr=error, align=<span style="color: #2d9574;">'center'</span>, alpha=0.5, ecolor=<span style="color: #2d9574;">'black'</span>, capsize=10)
ax.set_ylabel(<span style="color: #2d9574;">'Coefficient of Thermal Expansion ($\degree C^{-1}$)'</span>)
ax.set_xticks(x_pos)
ax.set_xticklabels(para)
ax.set_title(<span style="color: #2d9574;">'Coefficent of Thermal Expansion (CTE) of Three Metals'</span>)
ax.yaxis.grid(<span style="color: #a45bad;">True</span>)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Save the figure and show</span>
plt.tight_layout()
plt.savefig(<span style="color: #2d9574;">'bar_plot_with_error_bars.png'</span>)
plt.show()

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdb4797b" class="outline-2">
<h2 id="orgdb4797b">Backlinks</h2>
</div>


<div id="outline-container-orgcfec23c" class="outline-2">
<h2 id="orgcfec23c">1 Backlinks</h2>
<div class="outline-text-2" id="text-orgcfec23c">
</div>
<div id="outline-container-org50bde88" class="outline-3">
<h3 id="org50bde88"><a href="file:///home/sx/Dropbox/subjects/AI.html">AI</a></h3>
<div class="outline-text-3" id="text-org50bde88">
<p>
<a href="file:///home/sx/Dropbox/subjects/scitifical_package.html">scitifical package</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: sx</p>
<p class="date">Created: 2020-05-23 Sa 13:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
